# Ex3 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [24]:
import io
import requests
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"
s = requests.get(url).content
user_id = pd.read_table(io.StringIO(s.decode('utf-8')),sep='|')
user_id

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

### Step 4. See the first 25 entries

In [25]:
user_id.head(25)

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301
15       16   21      M  entertainment    10309
16       17   30      M     programmer    06355
17       18   35      F          other    37212
18       19   40      M      librarian    02138
19       20   42      F      homemaker    95660
20       21   26      M         writer    30068
21       22   25      M         writer    40206
22       23   30      F         artist    48197
23       24   21      F         artist    94533
24       25   39      M       engineer    55107

### Step 5. See the last 10 entries

In [26]:
user_id.tail(10)

     user_id  age gender     occupation zip_code
933      934   61      M       engineer    22902
934      935   42      M         doctor    66221
935      936   24      M          other    32789
936      937   48      M       educator    98072
937      938   38      F     technician    55038
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [27]:
len(user_id)

943

In [28]:
user_id.shape

(943, 5)

In [29]:
user_id.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [30]:
user_id.count()

user_id       943
age           943
gender        943
occupation    943
zip_code      943
dtype: int64

In [31]:
user_id.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

### Step 7. What is the number of columns in the dataset?

In [32]:
len(user_id.columns)

5

### Step 8. Print the name of all the columns.

In [33]:
user_id.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Step 9. How is the dataset indexed?

In [34]:
user_id.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [36]:
user_id.index

RangeIndex(start=0, stop=943, step=1)

### Step 10. What is the data type of each column?

In [35]:
user_id.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

In [40]:
user_id.user_id.dtype

dtype('int64')

In [41]:
user_id.age.dtype

dtype('int64')

In [42]:
user_id.gender.dtype

dtype('O')

In [43]:
user_id.occupation.dtype

dtype('O')

In [44]:
user_id.zip_code.dtype

dtype('O')

### Step 11. Print only the occupation column

In [47]:
user_id["occupation"]

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset?

In [51]:
len(user_id.occupation.unique())

21

### Step 13. What is the most frequent occupation?

In [52]:
user_id.occupation.mode()

0    student
Name: occupation, dtype: object

### Step 14. Summarize the DataFrame.

In [53]:
user_id.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [54]:
user_id.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

### Step 15. Summarize all the columns

In [79]:
user_id.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [81]:
user_id.value_counts()

user_id  age  gender  occupation  zip_code
1        24   M       technician  85711       1
634      39   M       engineer    T8H1N       1
622      25   M       programmer  14850       1
623      50   F       educator    60187       1
624      19   M       student     30067       1
                                             ..
319      38   M       programmer  22030       1
320      19   M       student     24060       1
321      49   F       educator    55413       1
322      20   M       student     50613       1
943      22   M       student     77841       1
Length: 943, dtype: int64

In [84]:
user_id.sort_values

<bound method DataFrame.sort_values of      user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]>

### Step 16. Summarize only the occupation column

In [56]:
user_id.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [55]:
user_id.age.mean()

34.05196182396607

### Step 18. What is the age with least occurrence?

In [75]:
s= user_id.age.value_counts()
s.argmin()

56

In [76]:
s.describe()

count    61.000000
mean     15.459016
std      11.762332
min       1.000000
25%       3.000000
50%      14.000000
75%      23.000000
max      39.000000
Name: age, dtype: float64

In [77]:
user_id.loc[user_id.age.min()]

user_id                   8
age                      36
gender                    M
occupation    administrator
zip_code              05201
Name: 7, dtype: object

In [78]:
user_id['age'][user_id['age']== user_id['age'].min()]

29    7
Name: age, dtype: int64

In [87]:
user_id.age.value_counts()

30    39
25    38
22    37
28    36
27    35
      ..
7      1
66     1
11     1
10     1
73     1
Name: age, Length: 61, dtype: int64

In [88]:
user_id.age.value_counts().index[-1]

73

In [99]:
print("min occurance age: "+ str(user_id.age.value_counts().index[-1]))

min occurance age: 73